In [1]:
import numpy as np
import pandas as pd

float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [2]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [3]:
string_data = pd.Series(['aardvark', None, np.nan, 'avocado'])
string_data

0    aardvark
1        None
2         NaN
3     avocado
dtype: object

In [4]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [5]:
float_data = pd.Series([1, 2, None], dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [6]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [7]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[~data.isna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [14]:
data.dropna(how='all', axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  0.337014       NaN       NaN
1  0.456283       NaN       NaN
2  0.089954       NaN  0.562964
3  1.263932       NaN -1.323375
4 -1.527274  0.375780  0.925130
5 -0.903940 -0.517164 -1.106900
6  1.296798 -0.560383 -0.420214

In [16]:
df.dropna()

          0         1         2
4 -1.527274  0.375780  0.925130
5 -0.903940 -0.517164 -1.106900
6  1.296798 -0.560383 -0.420214

In [17]:
df.dropna(thresh=2)

          0         1         2
2  0.089954       NaN  0.562964
3  1.263932       NaN -1.323375
4 -1.527274  0.375780  0.925130
5 -0.903940 -0.517164 -1.106900
6  1.296798 -0.560383 -0.420214

In [18]:
df.dropna(axis=1, thresh=2)

          0         1         2
0  0.337014       NaN       NaN
1  0.456283       NaN       NaN
2  0.089954       NaN  0.562964
3  1.263932       NaN -1.323375
4 -1.527274  0.375780  0.925130
5 -0.903940 -0.517164 -1.106900
6  1.296798 -0.560383 -0.420214

In [19]:
df.fillna(0)

          0         1         2
0  0.337014  0.000000  0.000000
1  0.456283  0.000000  0.000000
2  0.089954  0.000000  0.562964
3  1.263932  0.000000 -1.323375
4 -1.527274  0.375780  0.925130
5 -0.903940 -0.517164 -1.106900
6  1.296798 -0.560383 -0.420214

In [20]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.337014  0.500000  0.000000
1  0.456283  0.500000  0.000000
2  0.089954  0.500000  0.562964
3  1.263932  0.500000 -1.323375
4 -1.527274  0.375780  0.925130
5 -0.903940 -0.517164 -1.106900
6  1.296798 -0.560383 -0.420214

In [21]:
df.T.fillna({1: 0.5, 2: -1}).T

          0         1         2
0  0.337014       NaN       NaN
1  0.456283  0.500000  0.500000
2  0.089954 -1.000000  0.562964
3  1.263932       NaN -1.323375
4 -1.527274  0.375780  0.925130
5 -0.903940 -0.517164 -1.106900
6  1.296798 -0.560383 -0.420214

In [22]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0  1.131460 -0.412512  0.712461
1  1.239009  2.043028 -1.083702
2 -1.018988       NaN  1.451454
3 -1.530693       NaN  1.081228
4  1.715593       NaN       NaN
5  0.868479       NaN       NaN

In [23]:
df.ffill()

          0         1         2
0  1.131460 -0.412512  0.712461
1  1.239009  2.043028 -1.083702
2 -1.018988  2.043028  1.451454
3 -1.530693  2.043028  1.081228
4  1.715593  2.043028  1.081228
5  0.868479  2.043028  1.081228

In [24]:
df.ffill(limit=2)

          0         1         2
0  1.131460 -0.412512  0.712461
1  1.239009  2.043028 -1.083702
2 -1.018988  2.043028  1.451454
3 -1.530693  2.043028  1.081228
4  1.715593       NaN  1.081228
5  0.868479       NaN  1.081228

In [25]:
df.fillna(0, limit=2)

          0         1         2
0  1.131460 -0.412512  0.712461
1  1.239009  2.043028 -1.083702
2 -1.018988  0.000000  1.451454
3 -1.530693  0.000000  1.081228
4  1.715593       NaN  0.000000
5  0.868479       NaN  0.000000

In [26]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7, np.nan, 2., np.nan])
data.fillna(data.mean())

0    1.000
1    3.375
2    3.500
3    3.375
4    7.000
5    3.375
6    2.000
7    3.375
dtype: float64

In [27]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [28]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [29]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [30]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [31]:
data.drop_duplicates(subset=['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [32]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [33]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [34]:
data = pd.DataFrame({'food':['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                            'pastrami', 'honey ham', 'nova lox'],
                     'ounces':[4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [35]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [36]:
def get_animal(food):
    return meat_to_animal[food.lower()]

In [37]:
data['food'].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [38]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [39]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [40]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [41]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [42]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [43]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [44]:
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [45]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [46]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [47]:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [48]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [49]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [50]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [51]:
cats.categories[0]

Interval(18, 25, closed='right')

In [52]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [53]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
cats = pd.cut(ages, bins, labels=group_names)

In [54]:
cats

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [55]:
data = np.random.uniform(size=20)
data

array([0.06510583, 0.75993106, 0.99760785, 0.63193744, 0.63791307,
       0.90204878, 0.20789132, 0.50436527, 0.65402478, 0.41921024,
       0.33185047, 0.22357277, 0.71878796, 0.33001172, 0.79113953,
       0.91292361, 0.92736103, 0.34787945, 0.47173827, 0.48357667])

In [56]:
cats = pd.cut(data, 4, precision=2)
cats

[(0.064, 0.3], (0.53, 0.76], (0.76, 1.0], (0.53, 0.76], (0.53, 0.76], ..., (0.76, 1.0], (0.76, 1.0], (0.3, 0.53], (0.3, 0.53], (0.3, 0.53]]
Length: 20
Categories (4, interval[float64, right]): [(0.064, 0.3] < (0.3, 0.53] < (0.53, 0.76] < (0.76, 1.0]]

In [57]:
cats.value_counts()

(0.064, 0.3]    3
(0.3, 0.53]     7
(0.53, 0.76]    5
(0.76, 1.0]     5
Name: count, dtype: int64

In [58]:
data = np.random.standard_normal(1000)
data

array([-1.08568595e+00, -1.47261999e+00,  6.00058222e-01, -7.80501247e-02,
        6.54619211e-01, -4.24125519e-01, -1.96891416e-01,  5.24466139e-01,
        7.20711200e-01,  4.67232586e-01, -8.93129761e-01, -1.64725944e+00,
       -3.04534171e-01,  4.98707620e-01,  8.90882458e-01, -1.34759206e+00,
        4.40231579e-01,  6.11852025e-01,  3.87423654e-01, -6.88812392e-01,
        2.54540466e+00,  3.51198795e-01,  7.73770762e-01, -9.45491772e-01,
        1.49275684e+00, -9.50656350e-01,  7.21447018e-01, -5.74572913e-01,
        4.54278284e-01, -1.13299566e+00,  7.51002892e-01, -9.22527033e-01,
       -9.46891463e-01, -3.33152315e-01,  1.58181780e-02,  1.45979061e+00,
       -1.37980316e+00, -1.58530557e+00,  1.22357075e+00,  1.48169084e-01,
        2.47595625e+00, -1.38602988e-01,  5.62670608e-01, -8.23975978e-01,
       -3.74489008e-02,  8.32608969e-02, -2.29043169e-01, -1.50261214e+00,
        2.00490655e+00, -1.45132187e+00, -3.11246181e-02, -1.78357751e+00,
       -3.81881169e-01, -8.05893728e-01, -1.68241130e+00, -4.05169733e-01,
       -7.46200930e-02,  3.72818191e-01,  2.10898457e+00, -1.32487455e+00,
        1.13732771e+00,  1.60462635e+00,  5.92779447e-02, -1.02779184e+00,
        2.81073283e-01,  3.65738961e-01, -2.42805697e-01, -6.06682768e-01,
        1.16156301e+00, -1.46127936e+00,  1.22631379e+00,  2.07753854e+00,
        5.80695790e-01,  6.94378521e-01, -3.00185549e+00, -4.85325894e-01,
       -6.94681902e-01, -7.18349041e-01, -9.47958322e-02,  6.17649188e-02,
       -9.86394434e-01,  6.13775605e-01,  5.70970071e-01,  9.96319923e-01,
        4.55222959e-01, -1.28537650e+00,  3.00427120e-01, -6.25895491e-02,
       -1.21526761e+00, -7.40999183e-01, -1.15346299e+00,  2.11721760e+00,
       -7.34910901e-02,  7.10978032e-01,  1.34088221e+00, -3.76510971e-01,
       -6.01837098e-02,  2.88080067e-01,  1.43240384e+00,  1.53766067e+00,
       -7.58505724e-01, -5.19736731e-01, -1.75993792e+00, -9.97208978e-02,
       -3.50346267e-01,  6.61324683e-01, -4.67860832e-01,  1.34959741e+00,
       -3.57039478e-01,  7.50225358e-01,  1.05564731e+00, -7.23278165e-02,
        9.28448460e-01, -2.66062626e-02, -1.07561698e+00,  6.81725690e-01,
        1.96001375e+00,  3.21845288e-01, -3.04070242e-01,  4.54877727e-01,
        2.35013868e-01,  6.83027938e-01, -5.12410740e-01, -1.51075888e-01,
        5.94118924e-01, -4.58340802e-01, -8.75131537e-01,  4.70317673e-01,
        2.36727829e+00,  4.39168217e-01, -1.39016369e-01,  1.78032942e+00,
       -1.14350562e-02,  2.21546672e-01, -8.60305675e-01, -5.81414114e-02,
        4.99689908e-01,  6.02760944e-01,  1.09013510e+00,  1.25906696e+00,
       -9.80063542e-01,  6.25406282e-01,  2.68583905e-01,  1.25330624e+00,
       -2.68161634e-01, -2.01306512e-01,  3.17032803e-02,  5.94203157e-02,
        1.95172298e-02, -8.46706118e-01,  8.38652895e-01, -5.37434877e-01,
       -2.51136288e-01, -3.18991389e-01,  8.88839563e-02, -1.48365748e+00,
       -2.40296855e+00,  1.24882524e+00,  1.27877729e+00, -2.84071386e-01,
       -1.09439834e+00,  2.41062346e+00,  3.31766604e-01, -3.59162719e-01,
        1.05861959e+00, -3.45983702e-02, -1.32884025e+00, -2.57009747e-01,
       -3.03223544e-01,  6.06137314e-01, -5.92003757e-02,  1.47415383e+00,
       -1.34365274e+00, -6.76208448e-01, -3.82377573e-01,  1.15826975e+00,
        2.71639661e-02,  1.21833877e-01,  4.00785158e-01, -1.43878176e+00,
       -7.47634952e-01, -3.98359416e-01, -5.15156392e-01,  2.74039599e-01,
        3.45181686e-01, -2.49777040e-01,  1.40525359e+00,  9.20464140e-01,
        3.33757008e-01,  1.13324163e+00,  4.40109718e-02, -5.27162138e-01,
       -1.50955326e+00,  6.11846811e-01, -1.93109735e+00,  1.20927685e+00,
        3.28324495e-01, -1.01209965e+00, -2.67900817e-01, -9.81313010e-01,
       -4.49593695e-01,  5.50987584e-01,  1.27002568e-01, -1.79485959e-01,
        9.84362285e-01, -6.58998606e-01, -4.87220750e-01,  3.02731888e-01,
       -5.98961336e-01, -2.15228935e+00, -1.34650680e+00, -1.62245228e+00,
        6.42343698e-01, -1.01482555e+00, -3.89789681e-01,  1.29214467e+00,
        2.74880491e-01,  1.87270085e+00, -2.55256368e-02, -1.04230128e+00,
        6.15445198e-02, -7.11821468e-02,  1.10414244e+00, -8.47681757e-01,
        1.81488636e-01,  1.69811869e+00, -1.04163835e+00,  1.12399510e+00,
       -9.97583809e-01, -1.09264719e+00, -8.76185529e-02,  6.47209148e-01,
        8.45157531e-01, -4.22785996e-01, -5.05042179e-01, -1.18181857e+00,
       -8.19273862e-01, -1.89914506e-01,  6.74738740e-01,  1.26423584e+00,
       -5.12338796e-01,  1.26966325e+00,  1.05370660e+00,  5.84740136e-01,
       -5.46634260e-01, -2.66078634e-01,  3.29088104e-01, -1.68553128e+00,
       -6.69774136e-01, -1.60216892e-01, -1.61914286e+00, -1.28513127e+00,
       -4.62635115e-01,  3.68458271e-01, -1.09405502e+00, -1.34202499e-01,
        1.12213704e+00, -1.39440229e+00,  6.11556329e-01, -1.99156151e+00,
       -1.53863554e-01, -1.17210416e+00, -8.56139708e-01,  1.49143398e-01,
       -4.14522350e-01, -4.96796356e-02, -2.85641835e-01,  5.08601686e-01,
       -2.30566155e+00,  2.53665646e-01,  1.44390227e+00,  1.97454164e+00,
       -3.82293399e-01, -1.81210302e+00,  7.78471992e-01,  2.21156643e-01,
        3.36791501e-01, -4.84526206e-01,  2.12234415e-01, -4.79960461e-01,
       -2.31508830e-01,  2.73883198e-03,  8.98318725e-01, -1.83972491e+00,
       -1.13514661e+00,  1.31859302e+00, -3.81566179e-01,  1.73200608e+00,
        6.82628592e-01,  1.25748080e+00,  5.34015937e-01,  7.37203164e-01,
       -4.00978766e-01, -2.93283629e-01,  1.24677861e+00, -1.86199188e+00,
       -5.45652372e-01,  1.76481176e+00,  7.21276216e-01,  4.62025780e-01,
        7.93387276e-01,  8.62300129e-01,  3.21358851e-01, -1.95600451e+00,
        5.71534190e-01,  1.10937180e+00,  4.69956733e-01,  1.11167080e+00,
       -6.23779711e-02,  1.11820456e+00,  8.27211198e-02,  2.20551790e-01,
       -5.86098722e-01,  7.53267957e-01,  1.33527926e+00, -6.52980208e-01,
       -4.57394383e-01, -1.57110878e-01,  1.68463042e+00, -2.79585338e-01,
       -2.07550535e-01,  4.54874868e-01,  1.27558495e+00, -4.13089657e-01,
       -1.08606589e+00, -7.78068517e-01,  7.83354870e-01,  9.22076841e-01,
        3.14051383e-02, -7.37278110e-03,  6.96840508e-01, -1.27757236e-01,
        9.06850166e-01,  1.66925161e-02, -1.49577991e+00, -1.00789315e+00,
       -1.41176846e+00, -1.11978966e+00,  2.70818456e-01, -4.74654031e-01,
        3.99694224e+00,  1.69016352e+00, -2.09771261e+00,  1.19137011e-02,
        1.88225025e+00, -2.99769891e-01,  8.21765177e-01,  6.25370692e-01,
        2.50530185e-01, -1.48054146e-02,  1.87802123e-01, -9.55537099e-01,
        1.28089107e+00, -2.31567839e-01,  1.17957502e-01, -1.26193249e-01,
        1.34442050e+00, -1.32649247e+00, -9.51256817e-01, -9.15219953e-01,
        3.54959680e-01,  2.02409432e+00,  7.32498606e-01,  6.47938439e-01,
        2.60495150e-01, -9.71575308e-01,  1.01667229e+00, -5.99558234e-01,
       -8.83538034e-01,  7.61869108e-01,  4.09586805e-01,  1.03026898e+00,
        8.22503855e-02,  2.50067562e+00, -9.12621359e-01,  4.57414270e-01,
        2.93145668e-01, -4.19143516e-01,  1.95531311e-01,  1.25379545e+00,
       -4.86437700e-01, -2.79560997e-01, -4.43046129e-01, -3.93580329e-01,
        6.05192480e-01, -1.70185256e-01, -7.81786333e-01, -5.57827791e-01,
       -2.75312280e-01, -8.06337310e-01,  2.34409590e-01,  1.60015192e-01,
       -1.22995246e+00,  1.69071385e+00,  1.31629104e+00, -1.07363770e+00,
       -3.96333490e-01,  3.58176263e-01, -4.72127743e-01, -5.56760998e-01,
       -3.83577792e-01,  2.82067599e+00, -1.86867255e+00, -3.26135789e-01,
       -2.20870745e+00, -1.32756033e-01, -4.77492589e-02,  1.11915218e+00,
        5.05545072e-02, -3.26079354e-01, -1.90524106e+00,  6.19872420e-01,
        1.74426713e-01,  1.73782193e+00, -1.10805312e+00,  3.58771766e-02,
        5.18975714e-02,  1.25676198e+00, -5.50467940e-01, -2.40964280e+00,
       -6.73326370e-01, -1.49036900e+00,  2.91759516e-01,  4.26512564e-01,
        1.95630422e+00, -1.97912466e+00, -8.68611508e-01, -7.88059124e-01,
       -1.00509521e+00, -1.01228795e+00,  3.13134211e-01,  7.97751269e-01,
        1.57023209e+00,  1.74052550e+00, -8.11295788e-01,  8.45645314e-01,
        2.66029379e+00, -1.52410266e+00, -7.12106204e-01,  8.00863235e-01,
        1.17723968e-01,  8.08022963e-02,  1.36480268e-01,  8.45826718e-01,
        4.91312958e-01,  1.95583694e-01, -2.06732543e+00,  3.23127140e-01,
        3.49467109e-01,  1.44814462e+00, -7.54433169e-01,  1.39551702e-01,
        3.64012545e-01, -8.19678006e-01, -6.20736204e-01, -1.38077594e+00,
        4.19740130e-01, -1.64047704e+00,  1.87136732e-01, -2.30244075e-01,
       -1.03687702e+00,  5.26946012e-01,  4.25044558e-01,  3.93118663e-01,
        3.69753719e-01,  1.73694534e+00, -1.84755896e-01,  5.25298335e-01,
        2.35424210e-01,  1.10154830e+00, -1.36201741e+00, -2.91536134e-01,
       -8.64941807e-01, -1.05601036e+00, -6.32431139e-01,  5.58088581e-01,
        7.61297502e-02, -1.56751834e-01, -6.14599736e-01, -1.01606336e+00,
       -7.55326745e-01,  1.37383596e+00, -9.14824006e-01, -5.84798317e-01,
        5.41467004e-01, -1.63940429e+00, -1.40191939e+00, -8.61692430e-02,
        6.77819488e-01, -6.40405896e-01,  7.53550767e-01, -1.96775698e-01,
        4.57769728e-01, -3.79178295e-01,  8.26297453e-01,  2.13883039e-02,
        9.48472599e-01,  6.82904265e-01,  3.25441772e-01,  2.11675715e+00,
        2.03221424e+00, -4.99452975e-01,  1.05120239e+00,  4.83599852e-01,
        1.13000514e+00,  2.03330386e+00, -1.13362130e+00,  7.50082916e-01,
       -1.86974394e-01, -1.06244165e+00, -6.88890363e-01, -1.08476730e+00,
        2.00970786e+00,  1.52774765e+00,  1.74094900e+00, -5.09366228e-01,
       -1.15718634e+00,  8.96152600e-01, -4.38990662e-01,  5.84467754e-01,
        1.38237151e+00,  2.19195380e-02,  1.78221846e+00,  9.71986352e-01,
       -3.10733649e-01, -2.59524479e-01,  1.23911729e+00,  1.79792465e+00,
        7.12674981e-01, -2.11654632e-01,  1.83948119e-01, -4.02372856e-01,
       -6.58710009e-01,  2.77063472e+00,  9.16432399e-01,  2.16249813e+00,
       -3.22550389e-01,  6.99963814e-01, -9.96627215e-01, -4.89777221e-01,
        4.75899707e-01,  1.35968614e+00, -1.33085464e-01, -1.04526267e+00,
       -2.06086456e+00,  5.71153705e-01, -1.86162820e+00, -6.64834649e-01,
        4.33488231e-01, -1.60757224e+00, -1.78080282e+00, -9.50790956e-04,
       -5.61751910e-01, -6.20042703e-01, -1.08408458e+00, -1.22475862e+00,
        7.60169856e-01,  9.14167391e-01,  1.48767406e+00,  1.92700088e+00,
        4.27675824e-01,  2.37097143e+00,  9.96613009e-01, -1.16540325e+00,
       -1.63015401e-01,  1.21316383e+00, -2.13104830e+00,  2.14187846e-01,
       -9.57859254e-01,  2.62615585e-01, -1.41123616e-01,  1.25033499e+00,
       -4.80986879e-01,  2.92675365e-01,  4.20775629e-01,  6.44730012e-01,
        1.74047413e-01, -4.85845731e-01,  5.66612627e-01, -5.88444681e-01,
        2.22390376e+00,  9.58807910e-01, -6.33206467e-01, -1.16149678e+00,
       -1.06019204e+00, -6.22499341e-01, -6.71714049e-01,  2.28708907e+00,
       -9.09316396e-02, -1.06295629e+00, -3.26818632e-01,  1.39299543e+00,
        4.79013574e-01,  4.78321358e-01, -9.97734691e-02, -1.09785692e+00,
       -4.81311338e-01,  4.37703570e-01, -6.67268232e-02, -9.92208881e-01,
        1.84515493e+00, -1.62719265e+00,  9.18238895e-01, -6.12043397e-01,
        7.41920550e-01,  3.13516507e-02,  1.19212563e+00,  1.19649543e+00,
        2.65933143e+00, -1.48028107e+00, -6.42946297e-01, -1.06582823e+00,
        6.10624061e-01,  1.12911054e+00, -1.37380137e+00, -9.03225703e-01,
       -1.23017506e+00, -2.81664128e-01,  8.13151154e-01,  8.85260994e-01,
        1.39166682e+00,  2.96947920e-01, -2.57286894e-01,  1.38505089e-01,
       -3.20386976e-01,  1.53572708e+00,  2.47832274e-01,  2.79540708e-01,
        1.05665155e+00,  7.74926535e-01,  9.41191860e-01, -1.06498462e+00,
        8.83458519e-01,  2.17123536e+00,  5.09123436e-02,  1.98870075e-02,
        1.96901408e+00, -1.55944581e+00, -8.65656156e-01, -7.68832674e-01,
        9.76974218e-01,  1.59740655e+00,  2.94894101e-02, -7.70839272e-02,
        2.69090296e-01,  1.14338952e+00,  4.72430272e-01,  1.19134942e-01,
        4.44116139e-01,  2.01540459e+00, -1.80840104e-01, -4.41233943e-01,
        2.79189783e-01,  1.23128302e+00,  2.06711453e-01, -8.79639227e-01,
        5.59343897e-02,  4.05392392e-01, -1.59193145e-01,  1.66194148e-01,
        8.22419393e-01, -1.67053503e+00, -1.92978238e+00,  9.05261784e-01,
       -5.15797735e-01, -9.03316611e-01, -2.13233983e+00,  2.50600383e+00,
        1.08468229e+00,  5.41888409e-01, -2.45680534e-01,  4.98880701e-02,
        6.56231500e-01, -3.07882574e-02, -6.85344976e-01,  1.35811784e+00,
       -3.68920122e-01,  5.67039154e-01,  4.98085337e-01,  6.80709620e-01,
        8.43979752e-01,  1.54924026e+00, -1.56107971e+00,  1.70949597e+00,
       -1.23384240e-01,  3.24862867e-01, -1.04423788e+00,  4.46028379e-01,
        4.45304936e-01, -1.62762869e+00,  4.50929923e-01, -4.72224804e-01,
        2.70224357e-01,  1.39905218e+00,  2.54233445e-01,  3.22832568e-01,
        5.96795440e-01, -3.87648187e-01,  4.02615691e-01, -2.92790080e-02,
        4.35523099e-01,  1.03594528e+00,  6.35257099e-01,  3.91969644e-01,
       -8.76038304e-02,  1.83459990e+00, -1.13477942e+00,  2.81399798e+00,
        6.02117470e-01, -6.78101184e-01, -8.86060539e-03,  5.59034249e-01,
        7.78738612e-01, -1.82760481e-01,  1.12816619e-01,  1.35210160e+00,
       -3.25085934e-01,  2.85652416e-01,  6.35508133e-01, -8.00011213e-01,
       -6.59601924e-01,  1.46863737e+00, -1.37574506e-01, -1.40623883e+00,
       -2.58930956e+00, -6.73363254e-01,  4.62983599e-01, -2.31716113e-01,
       -2.66932756e-02, -3.43200081e-01,  2.31605736e-02, -4.88750548e-01,
        5.27351701e-01,  4.68533484e-01, -8.74795673e-01, -4.66110804e-01,
       -1.43858207e+00, -1.50183702e-03, -1.95918120e-02,  1.41649361e+00,
        7.34712531e-01,  5.02450034e-01, -1.27352644e+00, -1.83488548e-01,
        7.60925675e-01,  2.94496434e-01, -7.64978833e-01,  1.87751137e+00,
        1.53471489e+00,  1.13663016e+00, -8.42109062e-02,  3.93999096e-01,
        2.16895606e-01, -9.51114921e-01, -1.21010946e+00, -1.34243124e-01,
       -2.32943651e+00, -9.95582909e-01,  5.99323685e-01, -4.86298996e-01,
        2.50762789e+00, -6.23356491e-01,  1.11945811e+00, -4.50726868e-01,
        4.43087514e-01, -1.75489531e+00,  1.46562428e-01, -2.28076294e-01,
       -1.34310843e-01, -9.65051314e-02,  1.22273220e-01, -7.54760969e-01,
       -1.18906719e+00, -4.31291250e-01, -5.07718328e-01, -5.86788260e-01,
       -5.77490781e-01, -1.63144004e+00, -2.14219023e-01,  4.31057547e-02,
        8.72797364e-01,  1.55977764e-01,  2.68639151e-01, -5.57155507e-01,
       -9.21514206e-01,  5.87617103e-01, -1.63750138e+00, -1.05629268e+00,
       -6.80014657e-01,  3.02127630e-01,  1.00231791e+00, -1.21583880e+00,
        1.35842021e+00, -7.82929750e-01,  5.95697067e-01,  2.97576253e-01,
        5.88749814e-01,  5.84286752e-01, -2.40110437e-01, -1.10946461e+00,
        1.35877005e+00, -1.64507171e-01,  7.28781238e-01, -2.10754396e-01,
       -2.30094723e-01,  8.73600308e-02,  4.11922832e-02,  4.96554376e-02,
        7.70107665e-01, -5.92345148e-01,  2.50207456e-01, -2.39278624e-01,
       -9.44185639e-01,  5.43817452e-01, -4.21818836e-01, -2.56056552e+00,
        2.53973680e+00, -1.43996973e+00, -2.71025371e-02, -2.09742436e+00,
       -9.31960067e-01, -1.10506434e+00, -2.96647363e+00,  6.27541465e-01,
        8.11613368e-01, -3.98098099e-01, -1.82224307e-01,  3.86955951e-02,
       -1.00737677e+00,  7.59653595e-01,  9.56289953e-01, -2.24460490e+00,
        5.68841813e-01,  7.88670325e-01,  3.48503348e-01,  1.30403034e-01,
        1.04068292e+00,  3.07493616e-01, -1.52340722e-01, -1.40217054e+00,
        9.38846600e-02,  8.73090383e-01, -1.04478046e+00, -1.37654824e-01,
       -1.25253713e+00,  2.24574358e-01,  5.37699696e-01,  1.36705626e+00,
       -1.07979481e-02,  2.23044204e+00,  2.18244600e+00, -2.77104857e+00,
       -1.18545044e+00, -2.97790245e-01, -7.10441513e-01,  2.04663381e+00,
       -5.42669272e-03,  4.97588367e-01, -4.60204431e-02,  1.13913309e+00,
        2.03641898e+00,  1.03375948e+00,  9.67297912e-02, -4.87879202e-01,
        1.38501962e+00, -9.53638951e-02, -4.32868928e-01, -7.36839280e-01,
        9.15313086e-01,  4.16412774e-01,  1.30715747e-01, -7.81976705e-01,
       -5.39153550e-01,  9.24906356e-01,  4.74603242e-02,  1.02517635e+00,
       -1.71624451e+00,  9.22264419e-01, -1.45122229e+00,  2.35521909e-01,
       -5.71950151e-01,  1.03963998e+00, -6.27068095e-01, -1.56513134e-01,
       -1.65952376e-01,  1.47987346e-01, -5.70974706e-01,  1.32894403e+00,
       -1.11908130e-01, -7.24127791e-01,  9.93257101e-01, -1.26704231e+00,
        3.40776674e-01,  2.65022540e-01,  2.69626487e-01,  5.63795916e-01,
       -1.36674613e-02, -1.23285989e+00,  1.23527153e+00,  3.86227551e-01,
       -3.35312547e-01, -7.98964398e-02,  6.89083551e-02,  6.19228687e-01,
        1.62188842e+00, -7.84852983e-01,  1.38961118e+00, -1.70991242e+00,
        9.51804118e-01, -6.71989969e-01, -8.67969537e-01,  7.20434724e-01,
        1.09801794e+00,  5.22240247e-01, -1.90542337e+00,  8.80744521e-03,
        2.24332693e+00,  9.16318090e-01, -1.43060380e+00, -4.89948389e-01,
       -1.62013750e+00, -5.27211411e-01, -6.20540690e-02,  3.48842610e-01,
        1.06419612e+00, -9.75587654e-01, -8.08254688e-01,  5.64299089e-01,
        4.74335064e-01,  4.50472183e-02,  1.10347842e+00,  3.51370820e-01,
       -1.11873233e-01, -2.47126158e-01,  1.00311854e+00,  2.07681311e+00,
       -1.14284433e+00, -1.00171556e+00, -9.74025002e-01, -4.36119491e-01,
        4.24899960e-01, -6.86567335e-01, -6.04233165e-01,  9.24327112e-01,
        1.24616984e+00,  8.39011617e-01,  8.95509817e-01,  2.48076486e-01,
        1.32579661e-01,  3.10401885e-01, -3.46810043e-01,  1.66514383e+00,
        8.84023231e-01,  5.83422597e-01, -1.71384533e+00,  1.04230336e+00,
        8.70151085e-01,  1.19998345e+00,  3.11711531e-01, -1.12672494e+00,
        5.51272519e-01,  5.38618276e-01, -7.96819636e-01, -1.09673066e+00,
       -4.49390174e-01, -9.25152845e-02,  1.56481226e-01,  1.62062828e+00,
        9.64438959e-01,  5.75595576e-01, -5.97731457e-01, -2.20920885e-01,
       -2.79758379e-01, -2.78896978e-01, -1.85263089e+00, -9.08646627e-01,
       -8.10179879e-01,  1.70974270e+00,  4.60795701e-02,  9.07809774e-01,
       -1.21923283e+00,  1.24878974e-01, -3.05213586e-01,  8.66445102e-01,
       -1.38261078e+00, -1.47382444e+00,  3.48649763e-02, -1.04435527e+00,
        2.25326150e+00, -1.86549306e-01, -9.61446540e-02,  1.42993424e+00,
        1.09986860e+00, -5.51332803e-01, -1.51635881e+00, -7.71512608e-01,
        2.71876535e-01, -5.88514023e-01, -9.23416457e-01,  7.06090212e-01])

In [59]:
quartiles = pd.qcut(data, 4, precision=2)
quartiles

[(-3.01, -0.62], (-3.01, -0.62], (0.033, 0.69], (-0.62, 0.033], (0.033, 0.69], ..., (-3.01, -0.62], (0.033, 0.69], (-0.62, 0.033], (-3.01, -0.62], (0.69, 4.0]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.01, -0.62] < (-0.62, 0.033] < (0.033, 0.69] < (0.69, 4.0]]

In [60]:
quartiles.value_counts()

(-3.01, -0.62]    250
(-0.62, 0.033]    250
(0.033, 0.69]     250
(0.69, 4.0]       250
Name: count, dtype: int64

In [61]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.005125    -0.036629     0.026665     0.001184
std       0.981843     0.972681     1.014562     1.020741
min      -3.071982    -2.690767    -3.408909    -2.875024
25%      -0.659621    -0.737606    -0.678967    -0.716048
50%       0.035632    -0.019261     0.009747    -0.002826
75%       0.667435     0.593591     0.727788     0.698836
max       2.986756     3.219758     3.621621     4.233914

In [62]:
col = data[2]
col[col.abs() > 2]

15    -2.569324
25     2.158025
35    -2.170115
77     2.455078
136    2.302020
159    2.150545
183   -3.408909
220   -2.363258
229    2.057769
276    2.313740
278   -2.474499
282   -2.170210
329    2.161696
343    2.041034
390    2.236167
395   -2.420268
398   -2.674859
411   -2.387443
418    2.539911
420   -2.152754
425   -2.248587
437    2.007099
453    2.233615
485    2.065223
504   -2.525923
550   -2.522235
588   -2.223782
598    2.146156
606    3.213984
639    2.295621
640   -2.121455
647    2.044354
668   -2.240611
674   -2.004485
702    2.397357
706    3.621621
709   -2.238843
745   -2.176290
760    2.148492
772    2.387200
779    2.003635
818   -2.003381
842    2.129474
898    2.024459
909    2.205053
911    2.102256
925   -2.016585
928    2.847887
986    2.673577
Name: 2, dtype: float64

In [63]:
data[(data.abs() > 3).any(axis=1)]

            0         1         2         3
42  -0.656635 -0.668067 -0.381409  3.173925
97  -3.071982 -0.411122 -0.635261  1.700085
183  0.722632 -0.661332 -3.408909  1.394211
214 -1.493210  3.219758  1.212678 -1.376739
392  0.168001  0.349473 -1.170484  4.233914
502 -1.414188 -0.499444 -1.262036  3.684015
606  0.934937  0.517146  3.213984  0.762579
706 -0.195377  0.454702  3.621621 -0.477441

In [64]:
data[data.abs() > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.005053    -0.036849     0.026239    -0.000908
std       0.981620     0.971970     1.010586     1.013571
min      -3.000000    -2.690767    -3.000000    -2.875024
25%      -0.659621    -0.737606    -0.678967    -0.716048
50%       0.035632    -0.019261     0.009747    -0.002826
75%       0.667435     0.593591     0.727788     0.698836
max       2.986756     3.000000     3.000000     3.000000

In [65]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1 -1.0 -1.0 -1.0 -1.0
2 -1.0 -1.0  1.0 -1.0
3 -1.0 -1.0 -1.0 -1.0
4  1.0  1.0  1.0 -1.0

In [66]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [67]:
sampler = np.random.permutation(5)
sampler

array([3, 1, 2, 4, 0], dtype=int32)

In [68]:
df.take(sampler)

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6

In [69]:
df.iloc[sampler]

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6

In [70]:
col_sampler = np.random.permutation(df.columns)
col_sampler

array([3, 2, 5, 6, 1, 0, 4])

In [71]:
df.take(col_sampler, axis=1)

    3   2   5   6   1   0   4
0   3   2   5   6   1   0   4
1  10   9  12  13   8   7  11
2  17  16  19  20  15  14  18
3  24  23  26  27  22  21  25
4  31  30  33  34  29  28  32

In [72]:
df.T.iloc[col_sampler].T

    3   2   5   6   1   0   4
0   3   2   5   6   1   0   4
1  10   9  12  13   8   7  11
2  17  16  19  20  15  14  18
3  24  23  26  27  22  21  25
4  31  30  33  34  29  28  32

In [73]:
df.sample(3)

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6

In [74]:
df.sample(frac=0.5)

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27

In [75]:
df.sample(10, replace=True)

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
4  28  29  30  31  32  33  34
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13

In [76]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [77]:
pd.get_dummies(df['key'])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [78]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummies = df[['data1']].join(dummies)
df_with_dummies

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False

In [79]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames, engine='python')
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [80]:
dummies = movies['genres'].str.get_dummies('|')
dummies

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0
2,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0
3,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
3879,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3880,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3881,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3882,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0

In [81]:
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [82]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [83]:
np.random.seed(12345)
values = np.random.uniform(size=10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [84]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

In [85]:
s = pd.Series([1, 2, 3, None])
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [86]:
s.dtype

dtype('float64')

In [87]:
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [88]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [89]:
s.dtype

Int64Dtype()

In [90]:
s[3]

In [91]:
s[3] is pd.NA

True

In [92]:
s = pd.Series([1, 2, 3, None], dtype='Int64')
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [93]:
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())

In [94]:
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [95]:
df = pd.DataFrame({'A': [1, 2, None, 4],
                   'B': ['one', 'two', None, 'three'],
                   'C': [False, None, True, False]})
df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN   None   True
3  4.0  three  False

In [96]:
df['A'] = df['A'].astype('Int64')
df['B'] = df['B'].astype('string')
df['C'] = df['C'].astype('boolean')
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>   <NA>   True
3     4  three  False

In [97]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [98]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [99]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [100]:
'::'.join(pieces)

'a::b::guido'

In [101]:
'guido' in val

True

In [102]:
val.index(',')

1

In [103]:
val.find(':')

-1

In [104]:
val.count(',')

2

In [105]:
val.replace(',', '::')

'a::b::  guido'

In [106]:
val.replace(',', '')

'ab  guido'

In [107]:
import re

text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [108]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [109]:
regex.findall(text)

['    ', '\t ', '  \t']

In [110]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""

pattern = r'[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Za-z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [111]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [112]:
m = regex.search(text)
m

In [113]:
text[m.start():m.end()]

'dave@google.com'

In [114]:
print(regex.match(text))

None

In [115]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [116]:
pattern = r'([A-Za-z0-9._%+-]+)@([A-Za-z0-9.-]+)\.([A-Za-z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [117]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [118]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [119]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [120]:
data = {'Dave': 'dava@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dava@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [121]:
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [122]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [123]:
data_as_string_ext = data.astype('string')
data_as_string_ext

Dave     dava@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

In [124]:
data_as_string_ext.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [125]:
pattern = r'([A-Za-z0-9._%+-]+)@([A-Za-z0-9.-]+)\.([A-Za-z]{2,4})'
data.str.findall(pattern)

Dave     [(dava, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [126]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]
matches

Dave     (dava, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [127]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [128]:
data.str[:5]

Dave     dava@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [129]:
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dava  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

In [130]:
values = pd.Series(['Apple', 'Orange', 'Banana', 'Apple'] * 2)
values

0     Apple
1    Orange
2    Banana
3     Apple
4     Apple
5    Orange
6    Banana
7     Apple
dtype: object

In [131]:
values.unique()

array(['Apple', 'Orange', 'Banana'], dtype=object)

In [132]:
pd.unique(values)

array(['Apple', 'Orange', 'Banana'], dtype=object)

In [133]:
values.count()

np.int64(8)

In [134]:
pd.value_counts(values)

F:\Logs\Temp\ipykernel_24144\3297668723.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(values)

Apple     4
Orange    2
Banana    2
Name: count, dtype: int64

In [135]:
values.value_counts()

Apple     4
Orange    2
Banana    2
Name: count, dtype: int64

In [136]:
values = pd.Series([0, 1, 0, 0] *  2)
dim = pd.Series(['apple', 'orange'])
values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [137]:
dim

0     apple
1    orange
dtype: object

In [138]:
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [139]:
fruits = ['apple', 'orange', 'apple', 'apple'] * 2
N = len(fruits)
rng = np.random.default_rng(seed=12345)

In [140]:
df = pd.DataFrame({'fruit': fruits,
                   'basket_id': np.arange(N),
                   'count': rng.integers(3, 15, size=N),
                   'weight': rng.uniform(0, 4, size=N)},
                   columns=['basket_id', 'fruit', 'count', 'weight'])
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [141]:
fruit_cat = df['fruit'].astype('category')
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [142]:
c = fruit_cat.array
type(c)

pandas.core.arrays.categorical.Categorical

In [143]:
c.categories

Index(['apple', 'orange'], dtype='object')

In [144]:
c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [145]:
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [146]:
df['fruit'] = df['fruit'].astype('category')
df['fruit']

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [147]:
my_categories = pd.Categorical(['foo', 'bar', 'baz', 'foo', 'bar'])
my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [148]:
categories = ['foo', 'bar', 'baz']
codes = [0, 1, 2, 0, 0, 1]
my_cat_2 = pd.Categorical.from_codes(codes, categories)
my_cat_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [149]:
ordered_cat = pd.Categorical.from_codes(codes, categories, ordered=True)
ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [150]:
my_cat_2.as_ordered()

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [151]:
draws = rng.standard_normal(1000)
draws[:5]

array([-0.75938718,  0.90219827, -0.46695317, -0.06068952,  0.78884434])

In [152]:
bins = pd.qcut(draws, 4, precision=2)
bins

[(-3.13, -0.67], (0.69, 3.21], (-0.67, 0.02], (-0.67, 0.02], (0.69, 3.21], ..., (0.69, 3.21], (0.02, 0.69], (0.02, 0.69], (0.69, 3.21], (0.69, 3.21]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.13, -0.67] < (-0.67, 0.02] < (0.02, 0.69] < (0.69, 3.21]]

In [153]:
bins = pd.qcut(draws, 4, precision=2, labels=['Q1', 'Q2', 'Q3', 'Q4'])
bins

['Q1', 'Q4', 'Q2', 'Q2', 'Q4', ..., 'Q4', 'Q3', 'Q3', 'Q4', 'Q4']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [154]:
bins.codes[:10]

array([0, 3, 1, 1, 3, 0, 2, 3, 3, 1], dtype=int8)

In [155]:
bins.categories[:10]

Index(['Q1', 'Q2', 'Q3', 'Q4'], dtype='object')

In [157]:
bins = pd.Series(bins, name='quartile')
results = (pd.Series(draws).groupby(bins, observed=False).agg(['count', 'min', 'max']).reset_index())
results

  quartile  count       min       max
0       Q1    250 -3.119609 -0.673305
1       Q2    250 -0.672703  0.019655
2       Q3    250  0.019958  0.692732
3       Q4    250  0.695674  3.211418

In [158]:
results['quartile']

0    Q1
1    Q2
2    Q3
3    Q4
Name: quartile, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [159]:
N = 10_000_000
labels = pd.Series(['foo', 'bar', 'baz', 'qux'] * (N // 4))
categories = labels.astype('category')

In [160]:
labels.memory_usage(deep=True)

600000128

In [161]:
categories.memory_usage(deep=True)

10000540

In [163]:
%timeit labels.astype('category')

449 ms  55.5 ms per loop (mean  std. dev. of 7 runs, 1 loop each)

In [166]:
%time _ = labels.astype('category')

CPU times: total: 469 ms
Wall time: 444 ms

In [167]:
%%time
_ = labels.astype('category')

CPU times: total: 484 ms
Wall time: 486 ms

In [168]:
%timeit labels.value_counts()

318 ms  6.92 ms per loop (mean  std. dev. of 7 runs, 1 loop each)

In [169]:
%timeit categories.value_counts()

50.6 ms  8.82 ms per loop (mean  std. dev. of 7 runs, 10 loops each)

In [170]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [171]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [172]:
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [173]:
actual_categories = ['a', 'b', 'c', 'd', 'e']
cat_s2 = cat_s.cat.set_categories(actual_categories)
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [174]:
cat_s.value_counts()

a    2
b    2
c    2
d    2
Name: count, dtype: int64

In [175]:
cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
Name: count, dtype: int64

In [176]:
cat_s3 = cat_s[cat_s.isin(['a', 'b'])]
cat_s3

0    a
1    b
4    a
5    b
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [177]:
cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']

In [178]:
cat_s = pd.Series(['a', 'b', 'c', 'd'] * 2).astype('category')
pd.get_dummies(cat_s)

       a      b      c      d
0   True  False  False  False
1  False   True  False  False
2  False  False   True  False
3  False  False  False   True
4   True  False  False  False
5  False   True  False  False
6  False  False   True  False
7  False  False  False   True